tutorials/tubularReactor/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.13";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
1350
(
1175.84824349
1176.51313484
1176.52430869
1176.37233555
1176.14734923
1175.82654151
1176.47138209
1176.47019919
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1173;
    }
    wall01
    {
        type            fixedValue;
        value           uniform 1173;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1173;
        value           nonuniform List<scalar> 10(1173.08868241 1173.08644073 1173.08159995 1173.07449101 1173.06542938 1173.05479437 1173.04302119 1173.0305832 1173.01797086 1173.00566953);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
