tutorials/tubularReactor/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.13";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1350
(
(1.36293752867 -1.66366433936e-11 -0.0141739488175)
(1.68253671844 -8.42549620054e-10 -0.00634154735586)
(1.81631725628 -4.23832625683e-11 -0.00339526060774)
(1.89982981563 4.07680816697e-10 -0.00227550218094)
(1.96218859895 2.36860877759e-10 -0.00163887941111)
(1.35691050434 -4.5129637506e-11 -0.0371337544394)
(1.67269452453 -3.39317430697e-10 -0.0159783011593)
(1.80173190104 3.443354717e-11 -0.00894022292277)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.073 0 0);
    }
    wall01
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (1.073 0 0);
        value           nonuniform List<vector> 10((2.11986466953 3.03809068307e-11 -8.46385509646e-08) (2.08191230951 8.58505591082e-11 -1.93134187137e-07) (1.99841463476 1.36873144125e-10 -2.7681616319e-07) (1.87153974738 1.60410300738e-10 -3.53101794918e-07) (1.70164806351 3.68254980719e-11 -4.11937517721e-07) (1.48886957275 5.49925981328e-10 -4.40801193611e-07) (1.23326566046 2.72405205472e-10 -4.26935588823e-07) (0.934869639122 1.50098803607e-10 -3.59385311503e-07) (0.593701170116 7.74826094511e-11 -2.33374544897e-07) (0.20977259255 2.25570809143e-11 -4.70241470115e-08));
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
