tutorials/tubularReactor/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.13";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1350
(
101328.66025
101328.442073
101328.33258
101328.251481
101328.171812
101328.661035
101328.442001
101328.332461
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    wall01
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
