tutorials/tubularReactor/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.13";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1350
(
0.294383602766
0.294223491741
0.294223495259
0.294262389822
0.294319053527
0.294389051564
0.294233972463
0.29423703009
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.295080086836 0.29508008912 0.29508009266 0.295080098882 0.295080107932 0.295080120029 0.295080135813 0.295080156759 0.295080183935 0.295080210895);
    }
    wall01
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
0.295098226123
0.295104725508
0.29510706784
0.295107944642
0.295108328874
0.295108502004
0.295108513475
0.295108445928
...
)
;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.295081267287 0.295081831175 0.295083048864 0.295084837122 0.29508711661 0.295089791931 0.295092753617 0.295095882603 0.295099055512 0.295102150234);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
